{
    "Critical" : ["Level landings are deleted because the connected stairs have been regenerated.",
                "The file File Name you are trying to synchronize was modified by the third-party updater Updater Name(s) which is not currently installed.",
                "Not all parts were converted. Placeholders were added to fill the gaps. Check the fabrication service definition for the system.",
                "Entire extruded Roof is cut by cut Sketch.",
                "During upgrade, Revit discovered that the highlighted elements were marked with tags of the wrong category. These tags were deleted.",
                "The Actual Riser Height of stair is greater than the Maximum Riser Height specified in the stair type.",
                "Some objects were not deleted because they were pinned.  Dependent pinned objects were deleted because their host or parent element was deleted.",
                "There are duplicate instances of the same family in the same place. Delete duplicate instances to improve performance.",
                "Top reference is below Bottom reference for one or more Balusters. These Balusters are not created.",
                "Due to changes in elevation, there is not enough room to generate all of the parallel pipes. As a result, some pipe segments have not been generated.",
                "Walls overlap. Consider embedding walls, editing their extents or profile to avoid overlapping.",
                "Elements will be deleted.",
                "Wire Size Table \"File Name\" is missing or invalid. Use Electrical Settings to select a valid Wire Size Table.",
                "Sketch of element has large area - it may slow down selection, drawing and geometric computations. Consider breaking sketch into smaller portions, closer to construction conditions.",
                "Assembly was changed to a new type, but did not match the type. Geometry could have been changed due to a join condition.",
                "Some tags were not copied because they could not find a host.",
                "Due to changes in elevation, there is not enough room to generate all of the parallel conduits. As a result, some conduit segments have not been generated.",
                "Fabric Area is sketched completely outside of its host.",
                "Stair components in the multistory stair could not be created where building levels overlap. Use the Connect/Disconnect Levels tool to adjust the multistory stair as required.",
                "Ramp Run has complex boundary and may produce unreasonable geometry. Split it into few Runs by inserting Riser Lines at the end of each Run and at the beginning of the next one. If you want to create Ramp with arc an straight section you can do it using a Run tool.",
                "Some slab shape edit vertices were deleted because the Floor or Roof has changed its shape.",
                "None of the created elements are visible in View Type View. You may want to check the active view, its Parameters, and Visibility settings.",
                "The multistory stair/ramp could not reach its top level with integral number of flights.  Maximum number of flights below the top level is created.",
                "Property lines do not form a closed loop.  Area will not be computed.",
                "Rebar Container is placed completely outside of its host.",
                "There are identical rebar in the same place. This will result in double counting in schedules...",
                "Can't maintain the position of the Location Line in this Wall.",
                "Sketch of element contains too many objects - it may take long time to solve. Consider breaking sketch into smaller portions, closer to construction conditions.",
                "Can't find a host for Fabric Area.",
                "The level set as the Story Above for these levels has moved below these levels. This change will cause these levels to revert to the default Story Above.",
                ""

    
                ],

    "High" : ["Analytical Model for Structural Element has reset to its default location.",
            "Profile family cannot be applied to some hosts as the gap is not compatible with the profile on some host widths. Division of these hosts is performed without profiles. Reduce the gap value to divide with a profile.",
            "All instances of link \"Name\" have been deleted, but the model itself is still loaded. Remove the link using Manage Links dialog to save memory unless you are going to reuse it in this project.  Removing the link cannot be undone.",
            "Fillet cannot be created between rail segments since the fillet radius is smaller than the profile size.",
            "A Space was deleted from all model views but still remains in this project.",
            "Estimated Illumination failed. IES file not found for lighting fixture.",
            "Can't create corner Baluster",
            "Custom fitting was created.",
            "Cannot remove all elements from a Displacement Set while editing that Displacement Set.",
            "Two elements were not automatically joined because one or both is not editable.",
            "Start Overhang should be greater than 1/2 the wire diameter, but should be small enough to allow for the desired bar layout and end overhang within the overall length.",
            "A point element in a family was hosted on an edge outside its family and the edge no longer exists.  The point will remain placed but with no host.",
            "Cannot assign or add element to Circuit. The Voltage (Voltage) for the Circuit is out of range for the Line to Line Voltage for element (The Line to Line Voltage is specified in the assigned Distribution System).",
            "The setting for calculation of Volume Computations is not on. The analysis model produced will be approximate without the computation of Areas and Volumes",
            "Railing is placed on tread because there is no stringer.",
            "Link visibility overrides will be lost.",
            "Option conflict between rooms in the Revit link \"Unnamed\". \nThe room in the Revit link’s option \"Option 1\" overlaps a room in the main model. \nTo resolve the issue, open the Revit link file for editing, select the main model room, and use the Add to Design Option Set tool.",
            "Grouping the selected elements requires that additional element(s) also be grouped.  Description  To satisfy the grouping requirement, these additional element(s) will be automatically added to the group as well.",
            "Divided Surface gridlines could not be generated.",
            "Unexpected errors occurred while exporting these elements to the IFC file.",
            "Circular loop is detected during sizing because of the segment size and roughness. The sizing result may not be optimal.",
            "Some pinned objects were deleted because their parent or host object was deleted.",
            "The family Connector has been modified so the connection is invalid.",
            "Room has Space Type set to Plenum but has no ceiling surface.  A plenum must be separated from the space it serves by a ceiling.",
            "Imported Toposurface Points are located a large distance from the model and might not display properly. Points will be centered on the model instead.",
            "Sketching of a free form set produces only a single bar.",
            "Structural Beam System sketch can't be constrained to it's beam.",
            "Shared Sites in the link \"Name\" have been modified, but not saved back to the link. Upon reopening, instances of the link will return to their last Saved Positions. You can Save the link later via the Manage Links dialog.",
            "Host can't be cut because it has no geometry.",
            "The Mass contains geometry that cannot be combined.   Mass Floors, volume, and surface area, won’t be computed.",
            "Some elements are not sized because the system calculation is flow only. You may change the system calculation level to size them again.",
            "Can't create nosing on one or more treads.",
            "The support order for a beam/column connection has been changed.  When a beam is supported by a column that same beam cannot be coped by the column.  The existing coping has been removed.",
            "Equality constraints are not satisfied.  The action either violates a locked constraint or tries to modify a sketch based object outside of the sketch mode.",
            "An error occurred while trying to find the free part of a face of the bounding geometry for Room when processing the room-bounding element Name. The free part of the face is found by subtracting the portions of the face that overlap various room-bounding element faces.",
            "The connector is invalid, the size can not be determined from the connector.",
            "A wall and a room separation line overlap. One of them may be ignored when Revit finds room boundaries. Shorten or delete the room separation line to remove the overlap...",
            "There are undefined Spaces in the model! Recommend creating a Space schedule and checking the Area parameter of each Space for warnings.",
            "Multiple Space Type are in the same enclosed region.  The correct area and perimeter will be assigned to one Space Type and the others will display \"Redundant Space Type.\"  You should separate the regions, delete the extra Space Type, or move them into different regions.",
            "A user-defined structural member was deleted due to missing or deleted references.",
            "Bind Link failed to add detail element(s) to the attached detail group.  This may occur when Bind Link is replacing an existing group.",
            "Dormer Opening Cut is not fully defined. Cut was not performed.",
            "The following problems were encountered in the IFC file: Description",
            "Hydraulic separation requires an even number of junctions on the header pipe for accurate calculations. Add or remove junctions to complete the separation.",
            "Can't find a host for Path Reinforcement.",
            "The rebar handle does not have any constraint targets.",
            "A group or groups that was loaded was renamed because its name was not unique amongst the groups in the file being loaded.  Most likely a model subgroup had the same name as the loaded file.",
            "Modifiers not intersecting the plate were deleted",
            "The Tap must be attached to duct.",
            "Beam of user-defined type does not fit into beam system with clear spacing layout rule. Beam type is reset to default.",
            "While making curved beam type \"Type Name\" Shared Family Instances were not created",
            "Unable to maintain exclusion of some group members.  Some excluded members have been restored.",
            "Space Type computations only succeeded without considering the following elements.",
            "element is too thin.",
            "This dimension cannot be used to parameterize the Rebar Shape.",
            "A sweep in the main model cannot be hosted by an element in a Design Option--if you continue it will not be added to the design option set.",
            "A tag cannot be arrayed without copying the associated element.",
            "An error occurred in family \"Name\" and was automatically resolved. Please review changes made to the family.\nError Information:\n\"Text\"\nError Resolution: Name",
            "Can't create geometry for one or more risers.",
            "All associated Parts were deleted and the original was made visible in the view.",
            "The size of the network exceeds the current limit for flow/pressure analysis. In the Mechanical Settings dialog, under Pipe Settings – Calculation, disable the option to Use analysis for closed loop hydronic networks.",
            "Some elements are not sized because the system calculation level is none or performance. You may change the system calculation level to size them again.",
            "Connected element not supported - it is neither pure extrusion nor sweep. E.g. tapered, compound, welded or cellular elements are not supported.",
            "Material does not have a density defined. The weight of the Fabric Sheet cannot be computed.",
            "The resulting angle between the segments is too great or too small.",
            "Highlighted wall is set to be \"From roof\", however there is no roof below it that can be used.",
            "Type \"...\" has incorrect values for parameters. \"Total Length\" has an incorrect value.",
            "Copy/Monitor does not support cutting inserts in floors. Some openings were not copied.",
            "Some dependent elements were deleted by changing group type and cannot be retained.",
            "A calculation did not complete because the Classification parameter in the Mechanical Equipment family is not set. Edit the family and select the appropriate Classification.",
            "Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters.",
            "Can't cut instance of Symbol out of Wall.",
            "The calculated pressure drop of this pump is not computed because the critical path is not a closed loop. Check to see if there are other pumps intended for use within a secondary/tertiary loop. Use the Add Separation tool to define the secondary/tertiary loop.",
            "Mass contains no solid geometry. Mass Floors, volume, and surface area, won’t be computed.",
            "Can't find a host for Rebar.",
            "element: It is not possible to calculate the flow since the flow direction mismatch. Please check flow direction on all equipment in this system.",
            "Highlighted walls are attached to, but miss, the highlighted targets."
        


    
            ],

    "Medium" : ["Could not create a custom connection.",
                "The surface-based splitter does not intersect a face to be divided and will be ignored",
                "Some panels in this curtain system are slightly malformed.  The problem is most likely ignorable. This problem usually occurs when a panel or parts of a panel have been divided so that they are very narrow.  To better see the malformed panels, temporarily hide the mullion category and set display of lines to \"thin lines\" (using the command on the view menu).",
                "Constraints are not satisfied",
                "Elements can't be added to Option Set",
                "Spacing for Excess Length Fill is too small.",
                "The chain formed by these curve elements cannot be processed and will be ignored.",
                "\"K Coefficient from table\" is not supported on connector for the element",
                "The selected faces contain both upward and downward pointing faces. Only the upward pointing faces were used.",
                "There is only one component in this repeater.",
                "Two elements were not automatically joined because other elements at join are not editable.",
                "Sketch contains chains of curves or curves to which profiles cannot be applied and profile parameter of the division is ignored.",
                "Elements are disconnected!",
                "There are no add-ons installed to manage existing Structural Connections in the model.",
                "Element can't be removed or excluded from the Group because it is required by another Group element.",
                "Attempting to connect fabrication parts from different services.",
                "Curve elements which form chains connecting points shared by more than two curve elements are ignored.",
                "Can't make the expected join because of editability and design option restrictions.",
                "This wall sweep instance has different profile or material than it's type. You may delete the sweep, or if you ignore this warning, it will be regenerated according to it's type.",
                "Can't create one or more Middle Stringers.",
                "No Keynoting System associated with Tag Family.\nTo resolve, select keynoting system for the tag family.",
                "No valid auto-route solution at selected point.",
                "The link cannot be reloaded because it is loaded into another open document.",
                "A labeled dimension is being deleted, but the corresponding constraint belongs to a group and will not be changed. You can change it in group edit mode later.",
                "The chains formed by these curve elements cannot be ordered consistently in the their grid interval and will be ignored",
                "The highlighted wall cannot be joined to the highlighted roof because the wall meets the roof tangentially.",
                "Elements with independent justification not supported",
                "Coinciding splitting workplanes are encountered",
                "Parameter-defined type of curtain panels defined in a circular way and will be ignored.",
                "Unknown shape of connected element",
                "There are not enough elements in the network to perform the calculation.",
                "Unable to load attached detail group \"Type Name\".",
                "Invalid connections have been disconnected. Please reconnect them manually or use different fittings.",
                "Saved orientation will be lost after toggle view.",
                "Space Type Tag is outside of its Space Type.  Enable Leader or move Space Type Tag within its Space Type.",
                "The element (of type ) has an open connector (at connector #)",
                "The element (of type ) has a connector with a fitting joint mismatch (at connector #). The connections are the same gender.",
                "Profile family cannot be applied to some hosts as the edge match condition is not compatible with the profile on some host widths. Division of these hosts is performed without edge profiles.",
                "Cannot keep reference of joined element.",
                "While loading Type \"Name\", parameter \"Name\": Description",
                "The original sculpted face is lost.",
                "Some materials do not have correspondent in Advance Steel and were replaced with default value.",
                "Revit cannot create a rectangular grid by intersecting the current selection of elements (levels, reference planes, or curves drawn on reference planes) with the surface. Make sure that curves do not form closed loops. It is helpful if curves start and end outside the surface, rather than inside it.",
                "While making curved beam type \"Type Name\" Opening elements were not created",
                "Type \"...\" has incorrect values for parameters. \"Bar Engagement 2\" has an incorrect value.",
                "The layers you have selected contain more than one mesh. You may want to go back and import the meshes separately.  If you continue, the meshes will be combined and a new boundary will be created.",
                ""



            ],

    "Low" : ["The selected free form rebar is not planar. Sketching it will discard the current geometry.",
            "Joined solid geometry cannot be copied as a whole. Instead, select the individual extrusions, etc., using Pick box or Ctrl-select and copy them.",
            "Initial Equal Friction Sizing failed.",
            "Element cannot be removed from the solution. The solution is required to have at least two elements to be valid.",
            "A notch join can only be used when the run end tread is coplanar with the landing tread. Clear the Begin with Riser or End with Riser instance property for the run to use the notch join.",
            "Revit does not allow grouping of some of the selected elements.  These elements will not be included in the group.",
            "While making curved beam type \"Type Name\" Masking Region elements were not created",
            "Vertically compound wall type features sweeps, reveals, or split layers are not supported on non-vertical face. Consider using a simplified type.",
            "Can't change Instance's Family.  Try changing Instance's Host to a Level first.",
            "A boundary on this surface could not be autodetected. Revit will impose one, but it may be larger than you want.",
            "Curtain grid lines must have at least one segment.",
            "Profile family cannot be applied to non-slab like hosts. Division of these hosts is performed without edge profiles.",
            "Can't move Boundary Conditions",
            "The length of part near the fitting is fixed. Make it modifiable before changing fitting's extension.",
            "Can't place instance of Symbol",
            "You must Reload Latest before editing the element.  Changes will be temporary, and will not be saved.",
            "Invalid parent relationship for a Displacement element. No cycles are allowed.",
            "Curve element with zero length cannot be used as a splitter and ignored.",
            "Can't copy pinned element.",
            "Curtain grid lines cannot be copied.  If you are trying to copy the curtain wall, try using tab to select entire wall.",
            "Element is a built-in part of the family definition and cannot be deleted or added to groups.",
            "A selected \"...\" belongs to a \"...\" which cannot be added to an Option--it was not added to the Option Set.",
            "Zones cannot be copied.",
            "Group \"Type Name\" is now empty and will be deleted.",
            "Can't make type \"Family Name\".  It will be deleted.",
            "No valid element selected.",
            "No auto-route solution was found.",
            "To duplicate elevations, copy the elevation symbols in a plan view.",
            "An element may not reference an element in another Option of the same Option Set.",
            "An insert in the main model cannot be hosted by an element in a Design Option--if you continue it will not be added to the design option set.",
            "Couldn't find an appropriate Host.  Try selecting a different Host Face or switch Placement Mode.",
            "Circular support chain detected",
            "Segment is overconstrained. It has at least one parameterized dimension that conflicts with another dimension.",
            "Pipe Fitting/Accessory Pressure Drop Calculator Not Available: ...",
            "Sketch is overconstrained.",
            "A pad in the main model cannot be hosted by topography in a Design Option--if you continue it will not be added to the design option set.",
            "Elements can't be duplicated in a secondary Option",
            "The selected constraint targets do not generate a valid rebar. The bar preview corresponds to latest valid rebar.",
            "Could not create integral reveal for wall instance. Description",
            "Revit had the following problems importing the IFC file: Description",
            "Elements cannot be copied from multiple links at the same time.",
            "You cannot removed all the elements from current solution. At least there should be two elements in the solution.",
            "The highlighted element has been disconnected.",
            "Incomplete StructuralSection parameters",
            ""
            



            
            ]
}