{
  "Critical": [
    "Level landings are deleted because the connected stairs have been regenerated.",
    "The file File Name you are trying to synchronize was modified by the third-party updater Updater Name(s) which is not currently installed.",
    "Not all parts were converted. Placeholders were added to fill the gaps. Check the fabrication service definition for the system.",
    "Entire extruded Roof is cut by cut Sketch.",
    "During upgrade, Revit discovered that the highlighted elements were marked with tags of the wrong category. These tags were deleted.",
    "The Actual Riser Height of stair is greater than the Maximum Riser Height specified in the stair type.",
    "Some objects were not deleted because they were pinned.  Dependent pinned objects were deleted because their host or parent element was deleted.",
    "There are duplicate instances of the same family in the same place. Delete duplicate instances to improve performance.",
    "Top reference is below Bottom reference for one or more Balusters. These Balusters are not created.",
    "Due to changes in elevation, there is not enough room to generate all of the parallel pipes. As a result, some pipe segments have not been generated.",
    "Walls overlap. Consider embedding walls, editing their extents or profile to avoid overlapping.",
    "Elements will be deleted.",
    "Wire Size Table \"File Name\" is missing or invalid. Use Electrical Settings to select a valid Wire Size Table.",
    "Sketch of element has large area - it may slow down selection, drawing and geometric computations. Consider breaking sketch into smaller portions, closer to construction conditions.",
    "This sketch is large. Performance will improve if constructed as several independent sketches.",
    "Assembly was changed to a new type, but did not match the type. Geometry could have been changed due to a join condition.",
    "Some tags were not copied because they could not find a host.",
    "Due to changes in elevation, there is not enough room to generate all of the parallel conduits. As a result, some conduit segments have not been generated.",
    "Fabric Area is sketched completely outside of its host.",
    "Stair components in the multistory stair could not be created where building levels overlap. Use the Connect/Disconnect Levels tool to adjust the multistory stair as required.",
    "Ramp Run has complex boundary and may produce unreasonable geometry. Split it into few Runs by inserting Riser Lines at the end of each Run and at the beginning of the next one. If you want to create Ramp with arc an straight section you can do it using a Run tool.",
    "Some slab shape edit vertices were deleted because the Floor or Roof has changed its shape.",
    "None of the created elements are visible in View Type View. You may want to check the active view, its Parameters, and Visibility settings.",
    "The multistory stair/ramp could not reach its top level with integral number of flights.  Maximum number of flights below the top level is created.",
    "Property lines do not form a closed loop.  Area will not be computed.",
    "Rebar Container is placed completely outside of its host.",
    "There are identical rebar in the same place. This will result in double counting in schedules...",
    "Can't maintain the position of the Location Line in this Wall.",
    "Sketch of element contains too many objects - it may take long time to solve. Consider breaking sketch into smaller portions, closer to construction conditions.",
    "Can't find a host for Fabric Area.",
    "The level set as the Story Above for these levels has moved below these levels. This change will cause these levels to revert to the default Story Above.",
    "The level set as the Story Above for these levels is being deleted. This change will cause these levels to revert to the default Story Above.",
    "Highlighted floors overlap.",
    "Area Reinforcement is sketched completely outside of its host.",
    "A calculation did not complete because the connectors used by this family to connect to the network are not linked. Edit the family and link the connectors.",
    "A calculation did not complete because the flow and pressure loss values for the element are not set. Select the element and enter values for the Flow and Pressure Loss.",
    "The actual tread depth and riser height for one or more stairs of this type violates the stair equation.",
    "The ramp is not long enough to reach the top constraint.  Change the slope or increase the length of the ramp.",
    "Stair path position is reset because it doesn't intersect with all riser lines or is out of stair boundaries.",
    "Highlighted space separation lines overlap. One of them may be ignored when Revit finds space boundaries. Delete one of the lines...",
    "Stair bottom end exceeds or cannot reach the base elevation of the stair. Add/remove risers at the bottom end by control or change the stair run's \"Relative Base Height\" parameter in the properties palette.",
    "There are overlapping structural framing elements of the same type in the project found by Dynamic Update.",
    "Edits caused a new assembly type to be created.",
    "Area Reinforcements are colliding.  Aligning the Major Directions, or changing the Additional Offsets, can prevent collision.",
    "Can't create Railing. Thickness of Rail or Balusters might be too small. If you don't want Balusters, specify \"None\" for Baluster Shape.",
    "Beginning of run coincide with the end of previous run. Landing is not created between runs.",
    "One of the stairs inside multistory stairs top ends exceed or cannot reach the top elevation of the stair.",
    "The Actual Tread Depth for one or more Stairs violates the Minimum Depth set in the type.",
    "There are too many  area boundary lines in area scheme might result in increased model sizes on disk and in memory. Please investigate if area scheme is used in a proper way.",
    "Option conflict between rooms in the Revit link \"Unnamed\".\nThe room boundary differs from the apparent boundary in the linked view \"View Name\".To resolve the issue, open the Revit link for editing, and use room separation lines to divide the space in the main model.",
    "One of the stairs inside multistory stairs bottom ends exceeds or cannot reach the base elevation of the stair.",
    "Family occupies Number kilobytes of memory. Consider simplification of the family.",
    "Roof exceeds user-specified maximum height",
    "This array contains multiple copies of some identical geometry. Performance might be improved by using a nested family and arraying copies of its instances.",
    "Stair components are not continuously connected. This may cause incorrect representation and annotation.",
    "The geometry in this Mass instance is too complex to take advantage of the capabilities a Mass provides.  Please break it down into multiple Mass and family instances that are less complex.",
    "Cannot create geometry for flex duct. The flex duct is intersecting itself or the start and end are too close together.",
    "Highlighted walls overlap. One of them may be ignored when Revit finds room boundaries. Use Cut Geometry to embed one wall within the other...",
    "You have set the stair's multistory top level to None, and Revit will remove this parameter, if you want to create a multistory stair, please use Create Multistory Stair feature.",
    "Option conflict between rooms in the Revit link \"Unnamed\".\nThe room boundary in the main model of the Revit link differs from the apparent boundary in the linked view \"View Name\".\nTo resolve the issue, open the Revit link for editing, and use room separation lines to divide the space in the main model.",
    "Highlighted levels overlap...",
    "Actual Number of Risers is different from Desired Number of Risers. Add/remove Risers or change Desired Number of Risers in Stairs Properties.",
    "Option Conflict between Rooms.\nRoom in Option \"Option 1\" overlaps Room in the Main Model.\nTo resolve, select the Main Model Room and use the Add to Design Option Set command.",
    "The actual riser height for one or more stairs violates the maximum set in the type.",
    "The Actual Run Width of one or more runs is less than the Minimum Run Width specified in the stair type.",
    "Highlighted room separation lines overlap. One of them may be ignored when Revit finds room boundaries. Delete one of the lines...",
    "Space Type is not in a properly enclosed region",
    "Overlapping gridlines should be avoided, unless there are only two and one is host type dependent and the other is not.",
    "The Actual Tread Depth of stair is less than the Minimum Tread Depth specified in the stair type.",
    "Family definition contains too many elements. Consider simplification of the family.",
    "Wall and area boundary line overlap. Color fills, area tags and areas may not behave correctly...",
    "Some families have become unusable. Reload the families, or delete them from the model.",
    "A wall and a space separation line overlap. One of them may be ignored when Revit finds space boundaries. Shorten or delete the space separation line to remove the overlap...",
    "Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.",
    "Too many faces were created from imported meshes. Host by Face tools may not select the imported meshes correctly. Decrease the complexity of the file or try importing only selected layers to resolve.",
    "Rectangular opening doesn't cut its host.",
    "Some elements could not find new hosts after changing group type and will be deleted.",
    "Highlighted element's sketch could not regenerate and has been suspended.  Select the element and edit its sketch to fix the problem.  The element will display in magenta until you fix the problem",
    "Family contains other families loaded into it but not used. Consider purging family document from unused families and types.",
    "Highlighted inserts overlap with other inserts or completely miss their hosts.",
    "Opening not cutting anything.",
    "The ramp is not long enough to reach the top constraint plus top offset.  Change the slope or increase the length of the ramp.",
    "Rebar is placed completely outside of its host.",
    "Fabrication part is too large to fit on the sheet metal. Replace the part with multiple smaller parts, or notify the CAM operator.",
    "There are undefined Rooms in the model! Recommend creating a Room schedule and checking the Area parameter of each Room for warnings.",
    "Highlighted lines overlap. Lines may not form closed loops...",
    "Option conflict between rooms in the Revit link \"Unnamed\".",
    "There are identical instances in the same place. This will result in double counting in schedules...",
    "Can't make type \"Type Name\".  It will be deleted.  Failing family has been saved to \"File Name\"",
    "Thickness of this Floor may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in sections and details may not accurately indicate the Thickness shown in Type Properties.",
    "Railings are placed completely outside the host. It may change the adjustment of the railing to the host and its vertical position.",
    "Option Conflict between Rooms.",
    "Instance of in-place family is not cutting host.",
    "Constraints between geometry in the family can behave unpredictably on parameter modification.  To make the family reliable, constrain geometry to levels, reference planes, or reference lines.",
    "A large view has view detail level set to medium or fine. Generation of extraneous details harms performance.",
    "Elements have duplicate \"Value\" values."
  ],

  "High": [
    "Analytical Model for Structural Element has reset to its default location.",
    "Profile family cannot be applied to some hosts as the gap is not compatible with the profile on some host widths. Division of these hosts is performed without profiles. Reduce the gap value to divide with a profile.",
    "All instances of link \"Name\" have been deleted, but the model itself is still loaded. Remove the link using Manage Links dialog to save memory unless you are going to reuse it in this project.  Removing the link cannot be undone.",
    "Fillet cannot be created between rail segments since the fillet radius is smaller than the profile size.",
    "A Space was deleted from all model views but still remains in this project.",
    "Estimated Illumination failed. IES file not found for lighting fixture.",
    "Can't create corner Baluster",
    "Custom fitting was created.",
    "Cannot remove all elements from a Displacement Set while editing that Displacement Set.",
    "Two elements were not automatically joined because one or both is not editable.",
    "Start Overhang should be greater than 1/2 the wire diameter, but should be small enough to allow for the desired bar layout and end overhang within the overall length.",
    "A point element in a family was hosted on an edge outside its family and the edge no longer exists.  The point will remain placed but with no host.",
    "Cannot assign or add element to Circuit. The Voltage (Voltage) for the Circuit is out of range for the Line to Line Voltage for element (The Line to Line Voltage is specified in the assigned Distribution System).",
    "The setting for calculation of Volume Computations is not on. The analysis model produced will be approximate without the computation of Areas and Volumes",
    "Railing is placed on tread because there is no stringer.",
    "Link visibility overrides will be lost.",
    "Option conflict between rooms in the Revit link \"Unnamed\". \nThe room in the Revit link’s option \"Option 1\" overlaps a room in the main model. \nTo resolve the issue, open the Revit link file for editing, select the main model room, and use the Add to Design Option Set tool.",
    "Grouping the selected elements requires that additional element(s) also be grouped.  Description  To satisfy the grouping requirement, these additional element(s) will be automatically added to the group as well.",
    "Divided Surface gridlines could not be generated.",
    "Unexpected errors occurred while exporting these elements to the IFC file.",
    "Circular loop is detected during sizing because of the segment size and roughness. The sizing result may not be optimal.",
    "Some pinned objects were deleted because their parent or host object was deleted.",
    "The family Connector has been modified so the connection is invalid.",
    "Room has Space Type set to Plenum but has no ceiling surface.  A plenum must be separated from the space it serves by a ceiling.",
    "Imported Toposurface Points are located a large distance from the model and might not display properly. Points will be centered on the model instead.",
    "Sketching of a free form set produces only a single bar.",
    "Structural Beam System sketch can't be constrained to it's beam.",
    "Shared Sites in the link \"Name\" have been modified, but not saved back to the link. Upon reopening, instances of the link will return to their last Saved Positions. You can Save the link later via the Manage Links dialog.",
    "Host can't be cut because it has no geometry.",
    "The Mass contains geometry that cannot be combined.   Mass Floors, volume, and surface area, won’t be computed.",
    "Some elements are not sized because the system calculation is flow only. You may change the system calculation level to size them again.",
    "Can't create nosing on one or more treads.",
    "The support order for a beam/column connection has been changed.  When a beam is supported by a column that same beam cannot be coped by the column.  The existing coping has been removed.",
    "Equality constraints are not satisfied.  The action either violates a locked constraint or tries to modify a sketch based object outside of the sketch mode.",
    "An error occurred while trying to find the free part of a face of the bounding geometry for Room when processing the room-bounding element Name. The free part of the face is found by subtracting the portions of the face that overlap various room-bounding element faces.",
    "The connector is invalid, the size can not be determined from the connector.",
    "A wall and a room separation line overlap. One of them may be ignored when Revit finds room boundaries. Shorten or delete the room separation line to remove the overlap...",
    "A wall and a room separation line overlap. One of them may be ignored when Revit finds room boundaries. Shorten or delete the room separation line to remove the overlap. You can tab-select one of the overlapping elements to exclude it from the group instance.",
    "There are undefined Spaces in the model! Recommend creating a Space schedule and checking the Area parameter of each Space for warnings.",
    "Multiple Space Type are in the same enclosed region.  The correct area and perimeter will be assigned to one Space Type and the others will display \"Redundant Space Type.\"  You should separate the regions, delete the extra Space Type, or move them into different regions.",
    "A user-defined structural member was deleted due to missing or deleted references.",
    "Bind Link failed to add detail element(s) to the attached detail group.  This may occur when Bind Link is replacing an existing group.",
    "Dormer Opening Cut is not fully defined. Cut was not performed.",
    "The following problems were encountered in the IFC file: Description",
    "Hydraulic separation requires an even number of junctions on the header pipe for accurate calculations. Add or remove junctions to complete the separation.",
    "Can't find a host for Path Reinforcement.",
    "The rebar handle does not have any constraint targets.",
    "A group or groups that was loaded was renamed because its name was not unique amongst the groups in the file being loaded.  Most likely a model subgroup had the same name as the loaded file.",
    "Modifiers not intersecting the plate were deleted",
    "The Tap must be attached to duct.",
    "The Tap must be attached to pipe.",
    "Beam of user-defined type does not fit into beam system with clear spacing layout rule. Beam type is reset to default.",
    "While making curved beam type \"Type Name\" Shared Family Instances were not created",
    "Unable to maintain exclusion of some group members.  Some excluded members have been restored.",
    "Space Type computations only succeeded without considering the following elements.",
    "element is too thin.",
    "This dimension cannot be used to parameterize the Rebar Shape.",
    "A sweep in the main model cannot be hosted by an element in a Design Option--if you continue it will not be added to the design option set.",
    "A tag cannot be arrayed without copying the associated element.",
    "An error occurred in family \"Name\" and was automatically resolved. Please review changes made to the family.\nError Information:\n\"Text\"\nError Resolution: Name",
    "Can't create geometry for one or more risers.",
    "All associated Parts were deleted and the original was made visible in the view.",
    "The size of the network exceeds the current limit for flow/pressure analysis. In the Mechanical Settings dialog, under Pipe Settings – Calculation, disable the option to Use analysis for closed loop hydronic networks.",
    "Some elements are not sized because the system calculation level is none or performance. You may change the system calculation level to size them again.",
    "Connected element not supported - it is neither pure extrusion nor sweep. E.g. tapered, compound, welded or cellular elements are not supported.",
    "Material does not have a density defined. The weight of the Fabric Sheet cannot be computed.",
    "The resulting angle between the segments is too great or too small.",
    "Highlighted wall is set to be \"From roof\", however there is no roof below it that can be used.",
    "Type \"...\" has incorrect values for parameters. \"Total Length\" has an incorrect value.",
    "Copy/Monitor does not support cutting inserts in floors. Some openings were not copied.",
    "Some dependent elements were deleted by changing group type and cannot be retained.",
    "A calculation did not complete because the Classification parameter in the Mechanical Equipment family is not set. Edit the family and select the appropriate Classification.",
    "Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters.",
    "Can't cut instance of Symbol out of Wall.",
    "The calculated pressure drop of this pump is not computed because the critical path is not a closed loop. Check to see if there are other pumps intended for use within a secondary/tertiary loop. Use the Add Separation tool to define the secondary/tertiary loop.",
    "Mass contains no solid geometry. Mass Floors, volume, and surface area, won’t be computed.",
    "Can't find a host for Rebar.",
    "element: It is not possible to calculate the flow since the flow direction mismatch. Please check flow direction on all equipment in this system.",
    "Highlighted walls are attached to, but miss, the highlighted targets.",
    "Reference Lines can only be constrained to Reference Planes, Levels, Family Host, and other Reference Lines.",
    "Rendering library has not been installed, so the third party geometry cannot be created.",
    "Some elements were deleted because elements that they require for references were not copied.",
    "Instance of link needs Coordination Review",
    "The rail is not continuous.  Breaks in the rail usually occur at sharply-angled transitions. To fix the problem, try:/n - Changing the transition style in the rail type properties, or/n - Modifying the railing path at the transition.",
    "Deleted level was used to define plan region's view range./nReplace deleted level by level of parent view and adjust offset?",
    "Cannot assign or add element to Circuit. The Voltage (Voltage) for the Circuit is out of range for the Line to Ground Voltage for element (The Line to Ground Voltage is specified in the assigned Distribution System).",
    "Rebar Bend Radius is too big. Ignoring bend.",
    "The calculation could not be performed. Verify that pressure loss is specified for all required elements.",
    "Railings and Stringers will not be automatically generated due to bad Runs. This message may be incorrect if you have Edited the Sketch and modified some dimensions.",
    "A Space Type Tag was deleted, but the corresponding Space Type still exists.  You can place another tag for the Space Type using the Space Type Tag tool or select the ... and delete it.",
    "Cannot create geometry for flex pipe. The flex pipe is intersecting itself or the start and end are too close together.",
    "Miter plane for Wall Foundation join is too far away; Bisecting plane will be used instead.",
    "Invalid shape found in original. Parts could not be created.",
    "Opening partially cuts its host.",
    "Some of the mullions you are trying to place are too short for its types, and were not placed on the grid.",
    "Panels and mullions created by a curtain grid were created with slight inaccuracies.",
    "The valves in the line are in the wrong order./nThe mapping status will be removed. Adjust the valves in the correct order.",
    "Room has a negative volume? Room will be ignored in the energy analysis model.",
    "The multistory stair exceeds the top level. Constraints are not satisfied.",
    "Cut with voids, by reference plane and Start/End Join Cutbacks (from Geometrical position parameters) will be ignored.",
    "Open stringer can't be created for selected nosing profile. Set nosing profile to default to get open stringers created.",
    "Can't find a host for Fabric Sheet.",
    "During upgrade, an revision cloud from issued revision \"Name\" was moved.  Please double check the revision cloud to ensure it is located in the correct place.",
    "The energy analysis model does not contain any roof surfaces! If there are roofs in your model, please verify that they are space bounding, and make sure that the space offsets are high enough to include the roofs.",
    "The energy analysis model does not contain any roof surfaces! If there are roofs in your model, please verify that they are room bounding, and make sure that the room offsets are high enough to include the roofs.",
    "Changing the family for a MEP fitting might cause unexpected results.",
    "The selected fitting has invalid connections and must be deleted to continue.",
    "The host shape has changed and the family is no longer appropriate.",
    "Flow calculations do not calculate this pump together with the other pumps as one equipment set. Verify the flow distribution and add the pump to the equipment set, if desired.",
    "Room separation line is not joined, might cause performance issue with room boundaries computations.",
    "This element has an open connection. This may not be an error, but all open connections should be sealed with an end cap.",
    "Performance Warning: This family now contains labeled dimensions or tangency constraints as well as sketches with many segments. This may hurt performance. To improve performance, create elements that require complex sketches as nested families.",
    "An elevation symbol references views on more than one sheet. It will show a blank sheet reference. To show the correct references, use a separate elevation symbol for the views on each sheet.",
    "element: It is not possible to calculate the flow since all the components in this system have the flow configuration set to Preset or System. At least one component is required to have the flow configuration set to Calculated.",
    "Curve in rail sketch is too short for rail creation and ignored.",
    "Modifications done to the varying rebar set in this group have caused it to revert to a uniform one. This can occur for layout changes as well as modifications to the rebar geometry.\nThis case is specific to the varying rebar sets placed in structural elements with a complex geometry.",
    "Sizing failed. Flow for section is 0.",
    "Unable to create attached detail group in view \"View Name\" for the selected elements.",
    "Multiple Space Type are in the same enclosed region.  The correct area and perimeter will be assigned to one Space Type and the others will display \"Redundant Space Type.\"  You should separate the regions, delete the extra Space Type, or move them into different regions.",
    "Instance origin does not lie on host face. Instance will lose association to host.",
    "Space Type volumes overlap. Adjust the Upper Limit and Limit Offset properties of the Space Type.",
    "Can't find a host for Fabric Sheet.",
    "Can't find a host for Path Reinforcement.",
    "The wires of this custom fabric sheet type are longer than the bending sketch. The linear quantities shown in schedules and tags are not accurate.",
    "Instance is not cutting host.",
    "Landing depth is less than run width.",
    "View has clipping disabled. It causes view to draw too many elements.",
    "Can't create geometry for one or more Rails",
    "Cannot place the supports along the rail path.",
    "Pipe Size Table \"File Name\" is missing or invalid.",
    "Insert conflicts with joined Wall.",
    "Parameter \"Parameter\" has the same name with an existing shared parameter.",
    "Geometry in imported file has extents greater than 20 miles (33km).",
    "Dimensions or Tags that reference non-group members have been removed from group Name.",
    "Project contains unused families and/or types. Consider purging them out.",
    "The calculation has completed, but there may be an error in determining the critical path. Verify that flow is specified for all required elements.",
    "Can't create one or more Rails with desired offset",
    "Multiple Space Type are in the same enclosed region.  The correct area and perimeter will be assigned to one Space Type and the others will display \"Redundant Space Type.\"  You should separate the regions, delete the extra Space Type, or move them into different regions.",
    "Some columns in the project are excluded from the graphical column schedule view.",
    "The slope of this railing will not parallel the ramp at landings.  To get a parallel railing, split the railing sketch at the ends of landings.",
    "The slope of this railing may not parallel the stairs at runs and landings.  To get a parallel railing, split the railing sketch at the ends of landings.",
    "Shared parameter Name will be replaced by a built-in parameter with the same name. This may affect scheduling!",
    "Some items in service \"...\" were not loaded. You should validate the configuration in an Autodesk Fabrication product.",
    "Orphaned tags cannot be copied.",
    "Mass contains both solid and mesh geometry.  Mass Floors, volume, and surface area, may appear incorrect.",
    "Family definition contains view specific imports. Such imports are inaccessible in the project - consider removal.",
    "Level is slightly off axis and may cause inaccuracies.",
    "Space separation line is slightly off axis and may cause inaccuracies.",
    "Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view \"View Name\".\nTo resolve, select the Main Model Room and use the Add to Design Option Set command.",
    "Possible Member Instability, based on Release Conditions",
    "Vertical Extensions on these Walls overlap. This can cause undesirable Joins. Try starting with no overlap and extend the Walls toward one another.",
    "The default system \"element\" is now over 50 elements. To improve performance, Revit is no longer calculating the critical path pressure drop and the more complex duct sizing has been disabled. If you want to use these features, you must define logical systems in the model instead of using the default system.",
    "element: It is not possible to calculate the flow since there is inline equipment that is configured as end of line. Please check equipment in this system and make sure that the equipment connectors used inline have a global system classification and a calculated flow configuration. Global equipment connectors used inline should always be linked to each other.",
    "Stair top end exceeds or cannot reach the top elevation of the stair. Add/remove risers at the top end by control or change the stair run's \"Relative Top Height\" parameter in the properties palette.",
    "Option conflict between rooms in the Revit link \"Unnamed\".\nA room in the Revit link’s option \"Option 1\" overlaps a room in the Revit link’s option \"Option 1\".\nTo resolve the issue, open the Revit link for editing, and delete the duplicate room or use room separation lines to divide the space in the main model.",
    "Multiple dominating mullions on a grid face may cause ambiguous automatic adjustment of margins.",
    "There are identical fabric sheets in the same place. This will result in double counting in schedules...",
    "Room's lighting load is too high.  This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.",
    "The analytical model may be unstable when calculated by structural analysis software.",
    "One element is completely inside another.",
    "There is an invalid Curtain Panel in the model. This is probably caused by two Grid Lines almost meeting at a border of the Curtain Wall or Sloped Glazing, but not exactly at a point. The Curtain Panel can't be displayed.",
    "Elements in element are not connected in a single physical network due to one or both of the following:\n- There are disconnects in the system's physical network.\n- Elements in the system are connected to more than one physical network.",
    "Can't end Stairs with Riser because Riser Thickness is too small.",
    "Room's number of people or people load (sensible or latent) is too high.  This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.",
    "Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view \"View Name\".\nTo resolve, divide space with Room Separation Lines in the Main Model.",
    "Option Conflict between Rooms.\nRoom boundary differs from the apparent boundary in view \"View Name\".\nTo resolve, divide space with Room Separation Lines in the Main Model.",
    "Family volume can't be computed. The bounding geometry (in 3D) can't be found for Room. Room will be ignored in the energy analysis model.",
    "Monitored Link moved.",
    "The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only.",
    "Notch thickness should not be larger than landing thickness.",
    "Line is slightly off axis and may cause inaccuracies.",
    "More than one parallel pump set defined for the same loop. Verify the flow distribution and delete the extra set, if desired.",
    "The highlighted wall(s) cannot be joined to the highlighted roof because the roof does not entirely cover the wall(s).",
    "The element (of type ) has a connector with a fitting joint mismatch (at connector #). The connections are not the same size.",
    "Can't find a host for Fabric Area.",
    "Opening not cutting anything.",
    "Space Type Tag is displaying volume that can't be computed.",
    "Monolithic Stairs without Treads can't have Risers. Riser Thickness for Stairs Type was automatically set to zero.",
    "Can't find a host for Area Reinforcement.",
    "The constraints for the rebar with free form geometry are not set or modifications have caused the automatic constraints to be deleted. You can use Edit Constraints to assign new bar constraints.",
    "A subwall of this stacked wall is unjoined from its neighbors because it was pulled too far.",
    "Sketch of element contains multiple independent loops - splitting it in few independent elements might improve performance.",
    "The network is not well connected. Some elements may have unexpected flow and pressure loss values.",
    "Host object contains too many cutting inserts - it may take long time to update. Consider splitting host object into smaller pieces or using stacked walls.",
    "This truss layout family defines an offset or non horizontal top chord.  This may conflict with attachment or profile editing.",
    "Interior categories are enabled in a large view. Even though these objects may be obscured and invisible, they still have negative impact on performance.",
    "Curve is too short and may cause invalid geometry.,",
    "Can't cut instance(s) of Symbol out of its host.",
    "The selected fitting(s) cannot maintain connections to existing fabrication parts due to size, direction or angle differences. You must manually reconnect the open connections.",
    "Riser curve is too short to create nosing on it.",
    "Highlighted lines overlap...",
    "Can't find a host for Area Reinforcement.",
    "Fabric Sheet is placed completely outside of its host.",
    "Type \"...\" has incorrect values for parameters. The sum of bar engagements is greater than the total coupler length.",
    "Some elements became ineligible to be included in an assembly and were removed.",
    "Can't satisfy formulas for type Family Symbol.",
    "Type's parameter cannot recursively point to the type itself.",
    "Projection plane becomes invalid for this wall. Analytical model is reset to default position.",
    "The shapes for medium and fine detail levels of connected element are inconsistent",
    "Can't create geometry for one or more treads.",
    "Edits to the model will cause some Reinforcement hosted on Parts to be deleted.",
    "Cover offset is greater than host thickness.",
    "The placeholder curve will not be able to connect to the required fittings for placeholder convert",
    "Mass Floors may appear incorrect since the Mass contains mesh and solid geometry.",
    "There is Structural Rebar present in the project that no longer meet the criteria defined in Allowable Rebar Bar types parameter. Please review all existing Structural Rebar created with this Shape.",
    "Selected element(s) produced from Massing shape. Once deleted, the selected element(s) will not be regenerated",
    "A curtain grid line had invalid removed segment data.  When correcting data, Revit may have split curtain panels that should be combined.",
    "Duplicate code Value, description: Text",
    "A geometric inaccuracy was found in the element.",
    "Can't create one or more Side Stringers.",
    "Edits caused an assembly to match an existing assembly type and inherit a new name.",
    "Analytical Top Projection Plane is partially or completely below Analytical Bottom Projection Plane.  Please reset top and/or bottom planes to valid values.",
    "Rail profile must have one closed loop. Wrong profile will not be shown in profiles list for rail definition.",
    "Fabrication data may be incorrect",
    "Highlighted elements are joined but do not intersect.",
    "Structural Connection type has been changed to \"Generic Connection\".",
    "Wall part could not be properly adjusted for join condition.  Geometry may be inaccurate.",
    "Changes to the fabrication configuration forced some disconnections.",
    "The solution is in the opposite direction of the connection direction.",
    "Imported model is out of range.",
    "Due to the changes in parameters of their hosts some mullions became non-type driven.",
    "Room's power load is too high.  This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.",
    "Lining Thickness (Value) is too large for current Diameter (Value).",
    "Maximum pipe size diameter reached during sizing",
    "There are multiple intersections between splitting chain of virtual splitters defined by these elements and so one of the virtual splitters will be ignored",
    "The chain formed by these curve elements has multiple non-sequential intersections with the same gridline and will be ignored",
    "A geometrical error has occurred while checking for Interference. Reported interference may not be accurate.",
    "Your document contained a Massing element which has been upgraded to a Mass instance.  Please review the documentation on the new enhanced Mass capabilities to understand the implications of this change."
  ],

  "Medium": [
    "Could not create a custom connection.",
    "The surface-based splitter does not intersect a face to be divided and will be ignored",
    "Some panels in this curtain system are slightly malformed.  The problem is most likely ignorable. This problem usually occurs when a panel or parts of a panel have been divided so that they are very narrow.  To better see the malformed panels, temporarily hide the mullion category and set display of lines to \"thin lines\" (using the command on the view menu).",
    "Constraints are not satisfied",
    "Elements can't be added to Option Set",
    "Spacing for Excess Length Fill is too small.",
    "The chain formed by these curve elements cannot be processed and will be ignored.",
    "\"K Coefficient from table\" is not supported on connector for the element",
    "The selected faces contain both upward and downward pointing faces. Only the upward pointing faces were used.",
    "There is only one component in this repeater.",
    "Two elements were not automatically joined because other elements at join are not editable.",
    "Sketch contains chains of curves or curves to which profiles cannot be applied and profile parameter of the division is ignored.",
    "Elements are disconnected!",
    "There are no add-ons installed to manage existing Structural Connections in the model.",
    "Element can't be removed or excluded from the Group because it is required by another Group element.",
    "Attempting to connect fabrication parts from different services.",
    "Curve elements which form chains connecting points shared by more than two curve elements are ignored.",
    "Can't make the expected join because of editability and design option restrictions.",
    "This wall sweep instance has different profile or material than it's type. You may delete the sweep, or if you ignore this warning, it will be regenerated according to it's type.",
    "Can't create one or more Middle Stringers.",
    "No Keynoting System associated with Tag Family.\nTo resolve, select keynoting system for the tag family.",
    "No valid auto-route solution at selected point.",
    "The link cannot be reloaded because it is loaded into another open document.",
    "A labeled dimension is being deleted, but the corresponding constraint belongs to a group and will not be changed. You can change it in group edit mode later.",
    "The chains formed by these curve elements cannot be ordered consistently in the their grid interval and will be ignored",
    "The highlighted wall cannot be joined to the highlighted roof because the wall meets the roof tangentially.",
    "Elements with independent justification not supported",
    "Coinciding splitting workplanes are encountered",
    "Parameter-defined type of curtain panels defined in a circular way and will be ignored.",
    "Unknown shape of connected element",
    "There are not enough elements in the network to perform the calculation.",
    "Unable to load attached detail group \"Type Name\".",
    "Invalid connections have been disconnected. Please reconnect them manually or use different fittings.",
    "Saved orientation will be lost after toggle view.",
    "Space Type Tag is outside of its Space Type.  Enable Leader or move Space Type Tag within its Space Type.",
    "The element (of type ) has an open connector (at connector #)",
    "The element (of type ) has a connector with a fitting joint mismatch (at connector #). The connections are the same gender.",
    "Profile family cannot be applied to some hosts as the edge match condition is not compatible with the profile on some host widths. Division of these hosts is performed without edge profiles.",
    "Cannot keep reference of joined element.",
    "While loading Type \"Name\", parameter \"Name\": Description",
    "The original sculpted face is lost.",
    "Some materials do not have correspondent in Advance Steel and were replaced with default value.",
    "Revit cannot create a rectangular grid by intersecting the current selection of elements (levels, reference planes, or curves drawn on reference planes) with the surface. Make sure that curves do not form closed loops. It is helpful if curves start and end outside the surface, rather than inside it.",
    "While making curved beam type \"Type Name\" Opening elements were not created",
    "Type \"...\" has incorrect values for parameters. \"Bar Engagement 2\" has an incorrect value.",
    "The layers you have selected contain more than one mesh. You may want to go back and import the meshes separately.  If you continue, the meshes will be combined and a new boundary will be created.",
    "Failed to place cap on the open connector.",
    "Design Option \"Name\" cannot reference Design Option \"Name\".",
    "Fabrication Hanger didn't connect to the element.",
    "Elements have duplicate \"Engineering Type\" values.",
    "\"In order to add this \"...\" to the Option Set, you must also add its \"...\"--if you continue it will not be added to the Option Set",
    "Turning off the Crop Region of the view will remove all View Breaks. If the Crop Region is turned on at a later time, any desired View Breaks must be created again.",
    "Cannot copy wall panels unless their parent wall is also being copied.",
    "A chain formed by these curve elements defines a splitter belonging to multiple belt intervals and will be ignored",
    "Stairs tread/riser profile must have one loop. Wrong profile will not be shown in profiles list in Run/Landing Type properties.",
    "A structural framing element is attached to a wall whose Structural Usage is set to Usage.",
    "Some rows from the file could not be used.",
    "Cannot create object.",
    "Revit does not support Undefined connectors. The following have been replaced by the default connector: Connector Element",
    "The stringer/carriage is too short and will be deleted.",
    "Not all parts were converted. Eccentric transitions and taps that have offsets from the center line are unsupported and cannot be converted.",
    "The current edits are causing some webs to disjoin.  The truss layout family requires additional constraints to maintain these joins.",
    "Could not create Fascia. Description",
    "Can't copy some or all of the detailing with the view.",
    "There are no duct fittings defined in project. The default duct type for fittings will be set to none.",
    "These parts were not intersected by any references. They will not be divided.",
    "The calculation could not be performed due to overconstrained flow condition in the network.",
    "The calculation could not be performed. Verify that Flow is specified for all required elements. If you have an instance parameter defined for Flow, be sure that it is mapped to the corresponding parameter on the connector.",
    "Some elements were not copied.Description",
    "The stair cannot join to the floor. To join the stair to the floor structure layer, the floor¡¯s top surface must be coplanar with the stair¡¯s bottom surface.",
    "Ref Plane is slightly off axis and may cause inaccuracies.",
    "Only one side of the secondary/tertiary loop is separated. To correctly calculate the flow and pressure loss, add separation to the other end of the loop.",
    "Conduit with Fittings do not support Concentric Bend Radius, the bend radius of the conduit fittings will be same.",
    "There are not enough slots available on panel: Panel Name for a circuit to be added.  Please increase the maximum number of single pole breakers to be greater than Number or set it to 0.",
    "The calculation could not be performed. Verify the pressure on the input element.",
    "Thickness of this Roof may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in sections and details may not accurately indicate the Thickness shown in Type Properties.",
    "Room separation line is slightly off axis and may cause inaccuracies.",
    "Property lines intersect.  Area calculations will not be precise.",
    "Can't cut reference plane.",
    "Face defining this vertical Wall is no longer vertical.",
    "You have selected a mixture of modeling and view specific elements to array in an associative manner.  Only the model elements will remain grouped and associative.",
    "Highlighted geometry contains a path or edge that could not be divided.",
    "Grid is slightly off axis and may cause inaccuracies.",
    "Curve-Based Family is slightly off axis and may cause inaccuracies.",
    "You have one or more loads connected to this panel that are not displayed in the panel schedule. Add the load classification(s) to the associated template to report this information in the Loads Summary.",
    "The slope of stringer may not parallel runs and landings.  To get a parallel stringer, split boundary lines at the ends of landings.",
    "Cannot add element to Circuit. The Number of Poles for element does not match the Number of Poles (...) for the Circuit.",
    "Current tag keynoting system uses key value parameter that is not associated with this element category.\nTo resolve, associate parameter with category or change keynoting system.",
    "Cannot align the support on the posts.",
    "Some columns in Graphical Column Schedule exceed the segment's upper/lower bounds.  You can add levels or adjust the view parameters.",
    "Pinned objects deleted.",
    "The roof's cutoff failed and was removed; make sure the cutoff height is not below the roof.",
    "Space Type is not in a properly enclosed region",
    "While making curved beam type \"Type Name\" some Control elements were not created",
    "While making curved beam type \"Type Name\" 2D Detail Component elements were not created",
    "Link \"Space Type\" and the current model use different keynote tables.  Keynote values from the link will not be displayed.  \"Space Type\" is using \"Space Type\" while the current model is using \"Space Type\".",
    "Could not create Gutter. Description",
    "Shared Sites in the link have been modified, use move instance to reset the change.",
    "The calculation could not be performed. Verify the pump curve data.",
    "Adjacent slope-defining lines must have identical eave heights. Eaves were aligned to higher location automatically to avoid failure. Use the Align Eaves tool to specify desired location.",
    "Profile family cannot be applied to the hosts as the gap is not compatible with the profile on host widths. Division is performed without profiles. Reduce the gap value to divide with a profile.",
    "The application is unable to make a connection in that direction. If the connectors are pointing up, make sure that the elevations of the segments are above them. If the connectors are pointing down, make sure that the elevations of the segments are below them.",
    "Spacing should be greater than wire diameter, but smaller than overall length minus overhangs.",
    "Can't make monolithic Stairs.",
    "Line in Massing Sketch is slightly off axis and may cause inaccuracies.",
    "Group members had to be \"moved to the project\" (removed from their group instance) because they were not consistent with the group type definition.",
    "The one of parameters for the fitting is causing the geometry to fail.",
    "The element (of type ) has a connector with a fitting joint mismatch (at connector #). The connections are not the same shape.",
    "The surface-based splitter intersects a face to be divided in multiple places and this case is not currently supported",
    "The bent edge is shorter than the bend profile for this fabric sheet type.",
    "Elements too far apart for a simple Structural Connection. Please change order of connected elements for corresponding custom connection.",
    "There are curves in splitting chain of virtual splitters defined by these elements which intersect each other multiple times and so one of the virtual splitters will be ignored",
    "Wall is slightly off axis and may cause inaccuracies.",
    "Mass contains only mesh geometry, which can’t be used to compute Mass Floors, volume, or surface area.",
    "Reactions defined as Internal Load (Is Reaction) may no longer be valid since the analytical model has changed.",
    "Can't create stringers geometry.",
    "A corresponding Shortening modifier for the Start/End extension Geometric position parameters was created. Start/End extension Geometric position parameters will not be available anymore.",
    "Highlighted wall is set to be \"Up to roof\", however there is no roof above it that can be used.",
    "Two joined walls are no longer in a position to allow automatic insert copying. They are either non-parallel or non-overlapping.",
    "Some Spot Dimensions were not copied because some References were lost.",
    "The Multi-planar Depth of Rebar Shape is too small for current Out of Plane Bend Diameter.",
    "Type \"...\" has incorrect values for parameters. \"Bar Engagement 1\" has an incorrect value.",
    "Revit found one or more elements with multiple connectors. Select each element and then select the connectors to use for the analytical connection.",
    "All slots on panel: Panel Name are occupied. Some circuits will be disconnected from this panel.",
    "Rebar Cover Side/Edge is too large for sketch. Bar placement may be inaccurate.",
    "Beam and Slab Analytical Models do not have the same Analytical Projection Plane.",
    "Can't compute elevation profile for one or more Rails",
    "The zone does not have a mass floor as its bottom and will be classified as unconditioned space.  If this was not your intent, either join the form in the mass family to another form that has a mass floor, or add a mass floor to the mass instance touching the bottom of the form.",
    "The link between connector Index and connector Index is removed.",
    "Fabric Wire Diameter is too large.",
    "Can't place Baluster Patterns",
    "The flex duct length of Length exceeds the maximum specified length of Maximum Flex Duct Length",
    "A chain formed by these curve elements defines a splitter which lies too close to gridlines and will be ignored",
    "Beam or Brace is slightly off axis and may cause inaccuracies.",
    "The layers you have selected contain both contour lines and non-contour lines (lines of non-constant elevation). You may want to go back and select fewer layers, or you can continue, but the boundary of the site may be larger than you want.",
    "There are identical points in the same place. Lines created from points may not work as expected.",
    "The network is under constrained. You may specify the design flow value in the missing branches, or cap the open ends.",
    "Can't create one or more Balusters",
    "These elements' names were automatically changed to eliminate duplicates.",
    "Faces defining this Element cannot be reacquired.",
    "The elements you have selected for grouping contain dimensions or tags whose references are not all included in the selection being grouped and are not all included in a common model group.  As a result, some of the selected elements have not been included in the new group.",
    "The selected tree nodes number of system browser is wrong.",
    "While making curved beam type \"Type Name\" Filled Region elements were not created",
    "While making curved beam type \"Type Name\" some Reference Line elements were not created",
    "The created elements are only visible in Detail Level: Fine.",
    "Member support check is complete.  No unsupported elements detected.",
    "Can't create stringer at landing.",
    "At least one connector on the highlighted element is currently assigned to the element. In general items shouldn't be assigned to the Default Systems, but should be assigned as equipments or elements of a non-default system. Click the More Info button below for additional information on System Creation.",
    "The solution is failing to do the elements are not in the same Design Option.",
    "Light source is inside solid geometry. No light will be emitted during rendering.",
    "The element you are trying to connect to has a different system classification.",
    "The network needs an input or output element to perform the calculation.",
    "Distance between Analytical and Physical Models of Structural Element is beyond tolerance of Value",
    "The slope that you specified could not be applied to this pipe. Please check the items that it is connected to and make sure that they aren't constraining the slope of them.",
    "This Subregion now does not appear to overlap any Toposurface with an appropriate Phase and Design Option.",
    "Text is only imported if the \"Current View Only\" option is selected. To see the text in the original file, import again with this check box selected in the Import Dialog.",
    "Cannot assign or add element to Circuit. There is no assigned secondary distribution system for element.",
    "The structural column is attached to a non-structural target. ",
    "Can't create any energy analysis surfaces. There are no Room bounding elements defined in the current phase. Please check the Project Information settings.",
    "Cannot create specified transition at the rail corner, handrail/Top Rail cannot maintain continuous.",
    "Total connected load for Circuit Circuit Load Name is exceeding 80% of the defined rating (Rating).",
    "The analytical model for the structural element cannot be created by the auto-detect method. Adjust the analytical element or change the tolerance of the analytical model settings if the model is needed.",
    "Type generated gridlines will become non-associated due to changes in the type.  Press delete if you wish to remove them instead.",
    "Type \"...\" has incorrect values for parameters. \"External Diameter\" has an incorrect value.",
    "Default parameters have incorrect values. One reason for failure might be an edge length that is too short (it's smaller than bent radius).",
    "Highlighted area boundary lines overlap.  Color fills, area tags, and areas may not behave correctly...",
    "Space Type Volume is being calculated above the Upper Limit of this .... Change the Upper Limit and Offset or change the height of volume calculations.",
    "No parent Text \"Value\" for \"Value\"",
    "Material assigned to the Analytical Element does not contain Structure parameters - verify material content.",
    "Not all intersecting references (levels, reference planes or lines) could be used to intersect the surface",
    "The beam join being modified contains beam that are not visible.  Geometry of visible beams may be affected by hidden beams.",
    "While making curved beam type \"Type Name\" some Reference Plane elements were not created",
    "Structural Custom Connection has an inappropriate type assigned.",
    "The element is not connected to a circuit (at connector #)",
    "The current rebar component has no constraint. You can apply a new constraint by selecting a valid target. ",
    "Structural Truss sketch can't be constrained to its members."
  ],

  "Low": [
    "The selected free form rebar is not planar. Sketching it will discard the current geometry.",
    "Joined solid geometry cannot be copied as a whole. Instead, select the individual extrusions, etc., using Pick box or Ctrl-select and copy them.",
    "Initial Equal Friction Sizing failed.",
    "Element cannot be removed from the solution. The solution is required to have at least two elements to be valid.",
    "A notch join can only be used when the run end tread is coplanar with the landing tread. Clear the Begin with Riser or End with Riser instance property for the run to use the notch join.",
    "Revit does not allow grouping of some of the selected elements.  These elements will not be included in the group.",
    "While making curved beam type \"Type Name\" Masking Region elements were not created",
    "Vertically compound wall type features sweeps, reveals, or split layers are not supported on non-vertical face. Consider using a simplified type.",
    "Can't change Instance's Family.  Try changing Instance's Host to a Level first.",
    "A boundary on this surface could not be autodetected. Revit will impose one, but it may be larger than you want.",
    "Curtain grid lines must have at least one segment.",
    "Profile family cannot be applied to non-slab like hosts. Division of these hosts is performed without edge profiles.",
    "Can't move Boundary Conditions",
    "The length of part near the fitting is fixed. Make it modifiable before changing fitting's extension.",
    "Can't place instance of Symbol",
    "You must Reload Latest before editing the element.  Changes will be temporary, and will not be saved.",
    "Invalid parent relationship for a Displacement element. No cycles are allowed.",
    "Curve element with zero length cannot be used as a splitter and ignored.",
    "Can't copy pinned element.",
    "Curtain grid lines cannot be copied.  If you are trying to copy the curtain wall, try using tab to select entire wall.",
    "Element is a built-in part of the family definition and cannot be deleted or added to groups.",
    "A selected \"...\" belongs to a \"...\" which cannot be added to an Option--it was not added to the Option Set.",
    "Zones cannot be copied.",
    "Group \"Type Name\" is now empty and will be deleted.",
    "Can't make type \"Family Name\".  It will be deleted.",
    "No valid element selected.",
    "No auto-route solution was found.",
    "To duplicate elevations, copy the elevation symbols in a plan view.",
    "An element may not reference an element in another Option of the same Option Set.",
    "An insert in the main model cannot be hosted by an element in a Design Option--if you continue it will not be added to the design option set.",
    "Couldn't find an appropriate Host.  Try selecting a different Host Face or switch Placement Mode.",
    "Circular support chain detected",
    "Segment is overconstrained. It has at least one parameterized dimension that conflicts with another dimension.",
    "Pipe Fitting/Accessory Pressure Drop Calculator Not Available: ...",
    "Sketch is overconstrained.",
    "A pad in the main model cannot be hosted by topography in a Design Option--if you continue it will not be added to the design option set.",
    "A pad in a design option cannot be hosted by topography in the Main Model--if you continue it will not be added to the design option set.",
    "Elements can't be duplicated in a secondary Option",
    "The selected constraint targets do not generate a valid rebar. The bar preview corresponds to latest valid rebar.",
    "Could not create integral reveal for wall instance. Description",
    "Revit had the following problems importing the IFC file: Description",
    "Elements cannot be copied from multiple links at the same time.",
    "You cannot removed all the elements from current solution. At least there should be two elements in the solution.",
    "The highlighted element has been disconnected.",
    "Incomplete StructuralSection parameters",
    "Type Name has an unconnected Number connector (index = ...).",
    "The value should be in range of Value and Value.",
    "Invalid connection input",
    "Import contained some 3D data or points which can't be exploded.",
    "Document doesn't contain any warnings related to these elements.",
    "Failed to create core geometries.",
    "Analytical / Physical Model Consistency check is complete.",
    "There is no solution for this view. All the elements have been filtered for this view, select another view, and select solutions.",
    "Can't find new Area Scheme for Area Boundary",
    "Area separation line is slightly off axis and may cause inaccuracies.",
    "Curve in the sketch of a multi-segment grid cannot be constrained to a sub-grid.",
    "Cannot add or assign element to circuit.  Electrical objects belonging to different design options cannot be connected.",
    "Can't finalize Group member without finalizing the entire Group.",
    "Revit was unable to identify any spaces. If you are sure that spaces have been created in the project, please check the Project Phase setting to verify that the Project Phase matches the phase in which spaces have been defined in your project.",
    "Dimension had to be unlocked in order to remove sketch over-constraining.",
    "Cannot add element to System. The System Type for the available connector does not match the System Type (Type Name) for the System.",
    "Can't display the Wall Foundation, because the Wall's radius is too small.  Please increase the radius to display the Wall Foundation.",
    "One or more elements are not editable.",
    "Insert may be cutting fewer or more hosts than needed. The problem may be solved by forcing regeneration, e.g. by moving the insert out and back by a tiny distance in any direction.",
    "While making curved beam type \"Type Name\" CAD File elements were not created",
    "Profile family cannot be applied to the hosts as the edge match condition is not compatible with the profile on host widths. Division is performed without edge profiles.",
    "A Corner Mullion has been placed at the end of a Curtain Wall that is not joined to another Curtain Wall. The angle of the Corner Mullion will default to 90 degrees.",
    "Multiple instances of the same view in sheets not supported.",
    "A calculation did not complete because the Flow for the element is not set. Select the element and enter a value for the Flow.",
    "A pad in a Design Option cannot be hosted by a topography in another Design Option--if you continue it will not be added to the design option set.",
    "Axis cannot be copied.",
    "Group instances have had all their group members deleted and will also be deleted.",
    "The modification of the unit will cause the change of the Reinforcement rounding format. Do you want to continue?",
    "The group cannot be saved at this time because one of its instances is being edited.",
    "The current transformation of this specific truss layout will some sub members to overlap.",
    "Level can not be copied because level with desired name \"Name\" already exist in a target document.",
    "The shape for medium detail level of connected element contains rounding",
    "Detected physical connection between Structural Elements, but did not detect Analytical intersection.",
    "Divided Surface cannot be split by a closed arc or ellipse.",
    "The best way to control top and base of the Wall is to modify the Constraints and Offset Parameters in Properties dialog.",
    "A dimension labeled by a parameter is being deleted, but the elements will still be constrained. Push \"Unconstrain\" to remove the constraints or \"OK\" to leave elements constrained.",
    "End Overhang should be greater than 1/2 the wire diameter, but should be small enough to allow for the desired bar layout and start overhang within the overall length.",
    "Analytical model Adjustment distance exceeds current Adjustment Snapping Distance.  To adjust snap settings, go to the Structural Settings Dialog.",
    "Topographic elements are not visible in your current view. You can modify View Range settings in the view’s Properties or Visibility settings in Visibility/Graphics. It is often easier to edit topography in a Site view or a 3D view.",
    "Can't make roof.",
    "There are no visible constraint targets in the current view. Switch to another view to better visualize the constraints.",
    "Circuit is not assigned to a panel",
    "Attached groups can only be created for view specific elements belonging to non-3d model views.",
    "The column and target are joined. The attachment has been removed.",
    "The network uses the default pressure.",
    "Last member of group instance was excluded (deleted), removed, or moved to the project.  Group instance has been deleted.",
    "The light source cannot be deleted with UI.",
    "Memebrs of Family \"Name\" or a nested family thereof illegally refer to Elements outside the family.",
    "The mechanical equipment set was deleted because it does not contain 2 or more members.",
    "No element in a secondary Option can be referenced by an element outside that Option.",
    "The elements you have selected for grouping contain dimensions or tags which do not reference a common model group.  No detail group has been created.",
    "Can't paste duplicate types. Only non duplicate types will be pasted.",
    "This zone has no spaces.",
    "A structural element will be detached from grid(s) due to inconsistent group membership.",
    "The division contains no parts.",
    "Can't compute Railings Elevation Profile",
    "Label assigned to the multi-planar depth parameter is also used for one of the planar shape parameters.",
    "A shape dimension is labelled with a parameter that uses the Common - Length unit.  Please use Structure - Reinforcement Length instead.",
    "You are importing data into a surface that already contains points. You may want to go back, create a new surface, and import the data into that instead. You can continue, and Revit will sew the meshes together, but the boundary may be larger than you want.",
    "Unassigned System Type on Connector Index.",
    "In-place family contains multiple disjoined solids. Consider splitting in several in-place families.",
    "Element must be unique.",
    "A Room was deleted from all model views but still remains in this project.\n The room can be removed from any schedule or placed back in the model using the Room command.",
    "A Area was deleted from all model views but still remains in this project.\n The area can be removed from any schedule or placed back in the model using the Area command.",
    "Multi-planar shape's depth dimension has been deleted. Please assign a new one to multi-planar depth.",
    "element cannot be added to the instance of Group",
    "Elements were deleted.",
    "At least one of the overhangs in the major direction is lower than radius of the wire in the minor direction.",
    "One or more hatch regions were found in the imported file with unconnected boundaries.  These hatch regions will be ignored.",
    "An insert in a design option cannot be hosted by an element in the Main Model--if you continue it will not be added to the design option set.",
    "Subregions must have the same Phase Created parameter and Phase Demolished parameter as the host Toposurface. Subregion phase will be set to match the Toposurface.",
    "There are no fabrication part types found for the current Configuration and Service. Please select settings and reload the service to create the fabrication part types.",
    "Shape is underconstrained. Please add additional dimension constraints to the shape's diagonal edges. (Diagonal segments with only one dimension constraint are automatically given a second constraint to lie at an angle of exactly 45 degrees, regardless of how they are drawn. The current shape has more than one such segment in sequence, and the resulting constrained edges are co-linear.)",
    "An element cannot join to an element in a secondary Design Option unless it is in the same secondary Design Option.",
    "Maximum width and height reached during sizing",
    "An error occurred in family \"Name\" and was automatically resolved, but may require review by the family creator.\nError Information:\"Text\"\nError Resolution: Name",
    "An error occurred in family \"Name\" that cannot be automatically resolved.\nError Information:\n\"Text\"",
    "The level set as the Story Above for these levels is no longer a story level. This change will cause these levels to revert to the default Story Above.",
    "Cannot add element to Circuit. The Voltage for element is out of range for the Voltage (Voltage) for the Circuit.",
    "Unable to load detail group \"Type Name\".",
    "... is very short. If this is not intended, change its Upper Limit and Offset.",
    "Revit could not find a matching Name in \"Name\". Please check the routing preferences of \"Name\".",
    "Invalid type or number of input elements",
    "Failed to replace an instance face with its face regions.",
    "Action command has successfully processed Number elements",
    "Coping applied, but only in Medium Detail Level.",
    "Not all parts were converted. Check the fabrication service definition.",
    "Type \"...\" has incorrect values for parameters. The distance between the connected ends of the bars exceeds 10 bar diameters.",
    "The spacing in the minor direction is lower than diameter of the wire in the major direction.",
    "Attached Detail Group can’t be copied without its Model Group",
    "Attached detail group types cannot be copied without copying the model groups to which they refer.",
    "Families is not placed. Physical properties such as area will display as \"Not Placed\" in schedules. You can place the Families using the option bar in the Families tool, or you can delete the Families in a schedule. Room will be ignored in the energy analysis model.",
    "Collinear segments are not allowed in a Rebar Shape definition.",
    "Division family cannot be used for all widths of hosts. Division is performed without edge profiles.",
    "Stairs nosing profile must have one loop. Wrong profile will not be shown in profiles list in Stairs Type properties.",
    "The surface data in the file contains points only. If the topography gives unexpected results, use a file that contains points and faces.",
    "To Create Similar from a Legend View, first select the element, then activate the target view, then invoke Create Similar.",
    "Can't make cut-out.",
    "There is Pinned object near the fitting. Unpin it before changing fitting's extension.",
    "A relationship between Elements in Design Option and Design Option has been deleted. There is no corresponding relationship in the Primary New primary design option.",
    "Element defining the Curtain System is invisible in the current view.",
    "Failed to divide perimeter zone.",
    "Can't find the correct tree node in system browser according to the node index.",
    "Original is unloaded. Parameter values may be out of sync with the original until the link re-loaded.",
    "Annotations for some views cannot be displayed from the linked model.",
    "You have deleted elements that other users requested.",
    "Some dimensions were not copied because they could not find a reference.",
    "The Assembly was deleted because it no longer contained any elements.",
    "None of the created elements are visible in View Type View. You may want to check the active view, its Parameters, and Visibility settings, as well as any Plan Regions and their settings.",
    "Parts can only be merged if they all have the same material, the same creation and demolition phases, and the merged geometry consists of a single connected component.",
    "The solution is failing to do segments which are zero length.",
    "Invalid Input",
    "This element has an open connection. This may not be an error, but for flow calculations to work correctly all connections should be sealed with an end cap.",
    "Can't Paste Aligned to some views.",
    "Connection failed",
    "Description",
    "You have selected elements that are connected to a parent object in a System. These elements can not be removed from the System.",
    "Revit converted ... line(s).",
    "Fillet may cause the supports to unjoin from the rail.",
    "Shapes do not match. A connection could not be made.",
    "The component \"...\" cannot be directly placed in the project environment. Place it in either an In-Place Mass or in a family created from a \"Pattern Based\", \"Generic Model Adaptive\", or \"Mass\" template.",
    "Can't Copy to Clipboard elements from the project and a link instance at the same time.  Only elements from the project will be copied.",
    "Constraints may not be created to linked instances using Shared Sites.",
    "Cannot make point hosted by intersection.",
    "Fabrication Database reload could not swap out for newer parts.",
    "An error occurred while trying to find the region where a face of the bounding geometry for Room overlaps a face of a room-bounding element Name.",
    "Parameter assigned to the dimension has no value defined.",
    "Line in Sketch is slightly off axis and may cause inaccuracies.",
    "Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.",
    "Segments defining the Rebar Shape must be in a continuous loop.",
    "Editing of the constraints for the selected rebar is not available. However, the default automatic constraints may still work.",
    "The structural component that the hanger is attached to has changed to a different element.",
    "The view boundaries for the identified views are too large to export.\nUse a crop region to reduce the boundaries of the view.",
    "Rebar elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Rebar Type.",
    "Analytical model edge cannot have a length of zero (0). \nConsider changing analytical model edge projection settings or Auto-detect tolerance. \nDisable analytical model if not needed.",
    "Space Type is not in a properly enclosed region",
    "Splitters and grids do not define a consistent rectangular mesh on the face.",
    "Switching element type to Curtain Family. All Wall Sweeps or Reveals hosted by this instance will be deleted.",
    "Elements were deleted.  Use Edit Pasted Elements to keep them.",
    "Some parts not included in Merge. Parts can only be merged if they all have the same material, the same creation and demolition phases, and the merged geometry consists of a single connected component.",
    "Switching element type to Curtain element. All inserts in the element will be deleted.",
    "An insert in a Design Option cannot be hosted by an element in another Design Option--if you continue it will not be added to the design option set.",
    "This operation will convert the existing axis of revolution to a normal line.",
    "The network uses the default Reynolds number.",
    "Can't create element in this family.",
    "The following views could not be published.",
    "Switching wall type to Family Curtain Wall. All Dimension References to the side faces of the Wall will be deleted.",
    "During upgrade, pressure drop calculations for hydronic piping systems that use the Simplified Colebrook method have been recalculated to use the Colebrook equation.",
    "Lining Thickness (Value) is too large for current Width (Value).",
    "The element (of type ) has a connector with a fitting joint mismatch (at connector #). The connections are not the same joint type.",
    "A chain formed by these curve elements does engage any gridlines on the face to be divided and will be ignored",
    "Pinned objects were not deleted. To delete them, unpin them before using delete.",
    "Unable to bind some link instances.  Either the link contains no 3d elements or there was an error loading its elements into the current project.",
    "Cannot add element to Circuit. There is no available connector matching the Type (Type Name) for the Circuit.",
    "Two joined walls are in a position to allow automatic insert copying.",
    "Can't make workset editable. User \"Name\" has already checked it out.",
    "Fabrication fitting could not be made to fit.",
    "There are pinned objects in the run. To repostion, unpin them before using reposition.",
    "Run-Run join is not allowed, if they have same \"Start With Riser\"/\"End With Riser\" configuration at the joined end.",
    "... Bounding element is invisible in current view.",
    "Lines created by massing or picking 3d path are not editable.",
    "Cannot create specified fillet at selected rail join because the curves are already smoothed.",
    "The routing solution failed because there is no default fitting type specified or the fitting cannot be found in the project. Ensure the fitting is loaded in the project and try again.",
    "Not all of the excluded members of the select groups were fully restored.  You may be able to restore the remaining members individually or by performing \"restore all excluded members\" on sub-groups of the selected groups.",
    "Can't create Curtain Panel in opening. The opening is probably too small.",
    "Sample Numbering Error",
    "The specified angles are not compatible with your current layout. Check routing preferences and the specific angles used in Mechanical Settings.",
    "There are not enough elements in the network to perform the calculation.",
    "A Curtain System cannot be based on faces from multiple elements.",
    "The file File Name you are trying to synchronize was modified by the third-party updaters Updater Name(s) which are not currently installed.\n If you continue to Synchronize with Central or Reload Latest, data maintained by these updaters will not be updated properly. This may create problems when File Name is later opened when Updater Name(s) are present.",
    "Pipe Pressure Drop Calculator Not Available: ...",
    "Connections already exits for selected element.",
    "References to elements outside the group were removed from a grouped curve element.",
    "All instances of this Coordination Model have been deleted, but the model itself is still loaded. Do you want to remove it?\nRemove the model or add new instances using the Coordination Model dialog.",
    "The calculation could not be performed. Verify that pressure loss is specified for all required elements.",
    "No Keynote Parameter.\nTo resolve, select key value parameter in keynoting system.",
    "Error \"Text\" was automatically resolved by \"Name\"",
    "Can't keep Type Name extended to Type Name.",
    "Default Divide settings were not applied to Divided Path. Please adjust node spacing parameters manually.",
    "Workset is editable, but you must Reload Latest before editing the element.",
    "There are no valid views. Only views without dependents can be used.",
    "There are uneditable objects in the run. To repostion, check them before using reposition.",
    "Cannot add element to System. There is no available connector matching the System Type (Type Name) for the System.",
    "A face of a joined (i.e. one cuts another) mass could not be split into interior and exterior faces. Remove the cut to resolve.",
    "Can't create any energy analysis surfaces. There are no Space bounding elements defined in the current phase. Please check the Project Information settings.",
    "Structural rebar have automatic constraints that may conflict with dimensional constraints. Using dimensional constraints with structural rebar is not recommended and should be avoided.\nGrouped structural rebar is the only exception to this recommendation, since the automatic constraints are removed on grouped rebar.",
    "Can't Finish Group while in Sketch Mode.",
    "Some View Regions were removed. When the size of a View Region becomes zero, it is removed from the view.",
    "Number elements were deleted",
    "The solution is failing to do segments which are parallel and should intersect.",
    "Can't cut open/middle stringers geometry.",
    "Permission to edit the element cannot be obtained.  Changes will be temporary, and will not be saved.",
    "Can't project Analytical Model to Analytical Projection Surface",
    "Join failure caused by editability or design option related problem.",
    "Ignoring attempt to add family type \"Family type\" for a second time.",
    "Previous edits and /or wall joins will not be preserved on this operation.",
    "Group members failed while updating group.",
    "Wire elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Fabric Sheet Type.",
    "A dimension that has EQ constraints is being deleted, but the elements will still be constrained. Push \"Unconstrain\" to remove the constraints or \"OK\" to leave elements constrained.",
    "The selected curve is not hosted on a plane and cannot be used to intersect the Divided Surface.",
    "Grid can not be copied because grid with desired name \"Name\" already exist in a target document.",
    "Fabric Bend Diameter is negative.",
    "A group member's sketch or family is constrained to an element that is not a member of the group.  These constraints have been removed.",
    "The mullion(s) you are trying to place is too short for his type, and was not placed on the grid.",
    "Dimension has no parameter assigned to it.",
    "An attached Structural Foundation will be moved to the bottom of the Column.",
    "You have selected elements that are already part of other Circuits. They will be removed from the original Circuits and added to this one.",
    "While making curved beam type \"Type Name\" some Model Line elements were not created",
    "While making curved beam type \"Type Name\" some Symbolic Line elements were not created",
    "While making curved beam type \"Type Name\" Image elements were not created",
    "You have selected elements that are connected to a Panel object in a Circuit. These elements can not be removed from the Circuit.",
    "Default wall settings will be changed (Base Constraint: ..., Base Offset: ..., Top Constraint: ..., Top Offset: ...)",
    "Line associated with a joined face has been moved.  This action will cause the other walls to become disjoined from this face. Description",
    "Curve elements forming a single curve loop cannot be used as splitters and are ignored.",
    "Open Profile Loop can't be used as a Rail Profile",
    "There was not enough room to place the required fittings. Consider increasing the length of the segments, or moving them farther apart to generate a solution.",
    "Face defining this non-vertical Wall is vertical.",
    "Line is too short.",
    "The pasted selection includes a linked instance of this file \"File Name\".  A file cannot link itself, so the link was not pasted.",
    "A curve from the chain formed by these curve elements either intersects a gridline more than once or coincides with it and so the chain will be ignored",
    "The lap splice in the major direction is greater than the half of the overall length.",
    "Connection to a group failed. Modification of elements within a group is not allowed.",
    "A group has been changed outside group edit mode.  The change is being allowed because there is only one instance of the type.",
    "Can't find new hosts for this Element.\nIt will be deleted on Finish Paste unless repositioned or rehosted.",
    "Coordination Monitor alert : Description",
    "Faces defining this Roof cannot be reacquired. Either delete the Roof or leave as it is.",
    "Dimension had to be un-EQed in order to remove sketch over-constraining.",
    "The assembly was deleted because it no longer contained any elements.",
    "Segment is underconstrained. It requires additional parameterized dimensions.",
    "Unknown",
    "Can't keep elements joined.",
    "The hanger size does not match the size of the host, so it can not be connected.",
    "Element is slightly off axis and may cause inaccuracies.",
    "A chain formed by these curve elements is trying to be both U- and V- splitter",
    "Excluded elements restored in the link.",
    "Can't create this kind of element in this view in the current mode.",
    "A chain formed by these curve elements intersects other chain with the same grid orientation. Both chains will be ignored",
    "Can't construct surface.",
    "Invalid Balusters Pattern",
    "Column and target are both concrete. Geometries have been joined.",
    "To be able to remove the selected elements from the group the following additional element(s) will also be removed: Description",
    "Cannot assign element to circuit.  Objects that are demolished cannot be added to a circuit.",
    "Revit cannot import some of the geometry. \nThis result can be caused by various issues with the source file.Adjust the geometry in the file and try the import process again.",
    "The splitted element has one or more Tags without Leaders enabled and needs to be checked.",
    "Fixture \"...\" in the current file is hosted and cannot be moved automatically by Copy/Monitor. Use the Move command to relocate the fixture in the host file as required.",
    "This workset has changed in the Central Model.  Please Reload Latest before making this workset editable.",
    "\"Plan view DBViewType has invalid view direction parameter,",
    "There is no structural component to attach the hanger rod to.",
    "Some Spot Dimensions lost their References. Those Spot Dimensions will be deleted.",
    "The parameter Name doesn't exist in the Family. It will be ignored.",
    "Can't move element.",
    "Model Text deleted because it consists entirely of spaces and/or carriage returns.",
    "The automatic landing is converted to a sketch-based landing because the connected run(s) are deleted.",
    "You are creating a constraint inside the sketch of a property line.  Constraints inside a sketch can only drive elements within the sketch.  Usually you do not want property lines driven by other elements.  If you would like to constrain other elements to the property lines, you should add the constraints outside of sketch mode.",
    "The hanger rod was disconnected because there is no structural component above.",
    "SunAndShadowSettings cannot be copied.",
    "The rail path is closed at the start and end path point for extension creation.",
    "Some loops were skipped",
    "No eligible elements are selected for assembly creation.",
    "Fabric Area lap splice is incorrect.",
    "The sketch dimensions, that were used to create the sketch, have been removed from the completed rebar shape definition.",
    "Space Type bounding element might be misaligned.",
    "Some of the splitting references of this Divided Surface are invisible in the current view.",
    "Revit does not allow creating parts from certain elements. Parts will not be created from these elements.",
    "The highlighted column can't maintain attachment to the target.  It will be treated as unattached until it can intersect.",
    "You have selected elements that are already part of other System. They will be removed from the original Systems and added to this one.",
    "A panel schedule cannot be created for these panels. A default panel schedule template must be assigned for this template type.",
    "\"Text\" is not a Grid line name",
    "A dimension that has lock constraints is being deleted, but the elements will still be constrained. Push \"Unconstrain\" to remove the constraints or \"OK\" to leave elements constrained.",
    "There are rebar components with invalid constraints. The bar preview corresponds to latest valid constraints. \nRebar components are the geometrical references that define the bar set. For example, the shape segments or the host surface.",
    "Mullions and panels cannot be copied without copying the entire curtain wall.",
    "Some types of elements can't belong to an Option.  Elements of these types were not added to this Option Set.",
    "You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.",
    "Details will be deleted if they reference group members being ungrouped in other instances of this containing group.",
    "Elements have changed category. Tags for these elements are now of the wrong category and will be deleted.",
    "Conditions for wall embedding are no longer satisfied.",
    "Cannot understand Text line: Number",
    "The active workset is closed so the circuit path will not be displayed.",
    "Cuts on concrete members are ignored.",
    "The Surface being Graded was created in the current Phase. Grading it will result in it being created and destroyed in the same Phase.",
    "Values of structural section parameters are incomplete.",
    "Elements in ... were deleted",
    "The sheet cannot accommodate this many wires at the current spacing. Try increasing overall length/width, or decreasing end overhangs.",
    "The placeholder curve is not long enough to support the required fittings for placeholder convert",
    "Can't convert Instance's Work Plane to Host.  Try resetting Work Plane to a Level.",
    "Division family cannot be used for some widths of hosts. Division of these hosts is performed without edge profiles.",
    "Could not create Wall Sweep. Description",
    "The pressure calculation could not be performed.",
    "Loaded family curtain panels cannot be used in non-rectangular cells of the curtain host. Type-driven panels from non-rectangular cells were unlocked and left unchanged.",
    "Overall Length/Width is Too Small.",
    "Some Dimensions lost some of their References on paste.",
    "You are attempting to connect incompatible connectors. No couplings can be added automatically. To continue, change connector(s) or add couplings.",
    "Duplicate fields across key schedules will be removed after paste.",
    "No Loss Defined",
    "This element is not part of the network.",
    "Duct Pressure Drop Calculator Not Available: ...",
    "The model has no occupiable spaces.",
    "No columns are joined to grid lines, or view parameters exclude all columns.",
    "The chain formed by these curve elements has multiple sequential intersections with a gridline and so the chain will be ignored",
    "One or more references of the highlighted element have become invalid.",
    "Parts were not created because fabrication configuration is not available.",
    "Stair components are not connected.",
    "Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost.",
    "... caps were added.",
    "Switching element type to Curtain Family. All Split Face Regions in the element will be deleted.",
    "Default Divide settings were not applied to Divided Surface. Please adjust grid spacing values manually.",
    "Category Color Fill Legend can only be placed in a Floor Plan View.",
    "The parameter Phase Created of the Toposurface is not set to the first Phase. No pre-existing toposurface were detected. The parameter will be reset to the first Phase unless Keep Phase Created option is picked.",
    "This hydraulic loop is not separated at any junction. Use the Remove Separation tool to clean up undesired hydraulic separations.",
    "Size Lookup Table is not available for type Family Symbol.",
    "The column is already attached. It will be detached and attached to the new target.",
    "Parts were not created because the element does not have a valid system.",
    "Can't align Analytical Model with joined Walls.",
    "Can't create Baluster Patterns for Railings",
    "The links between connector Index and connector Index, connector Index and connector Index are removed.",
    "Infilling element was automatically moved to keep it aligned to host.",
    "Unable to generate some fabrication shape details",
    "Parameter-defined type of curtain panels defined in a circular way and default panel type will be used instead.",
    "A corresponding Contour cut for the Opening(-s) by face created on the structural element was created. The Opening by face will no longer modify the fabrication shape.",
    "A sweep in a Design Option cannot be hosted by an element in another Design Option--if you continue it will not be added to the design option set.",
    "Cannot solve rebar shape using the current constraints.",
    "Non-linear elements not supported",
    "Element has already been copied. Stop existing monitoring to copy again.",
    "Can't place inserts outside of hosts. These elements won't be copied.",
    "Plumbing Flow Calculator Not Available: ...",
    "Family Validation Warning(s): Description",
    "Existing locked constraints to the Location Line will be transferred to the new Location Line position. Press \"Unconstrain\" to remove the constraint rather than transferring it.",
    "The energy calculation could not be performed.",
    "The sketch dimensions, that were used to create the sketch, have been removed from the completed bend profile definition.",
    "Regenerating elements.",
    "Could not create geometry for Space Type.",
    "Cannot create a new split line based on the picked support.",
    "The segment is being drawn from the wrong side to connect to the location you indicated.",
    "Can't convert Instance's Host to Work Plane.  Try resetting Host to a Level.",
    "No file has been saved.",
    "Space Type computations failed. Try to modify the following elements.",
    "Wall and instance have different phasing settings. Automatic creation of the infilling wall fails.",
    "Rail customizations on the instance may be lost if you change the rail type. \nClick OK to continue with the rail type change to other rails but except the customized ones.\nClick Reset Rails to make type change and discard customizations.\nClick Cancel to rollback the type change.",
    "Constraints may not be created to linked instances using Shared Sites.  Constraints will be removed.",
    "Fabrication straight exceeds the standard length. Use the Optimize Length command to adjust the length.",
    "Deleting this element deleted Parts associated with that element.",
    "Element will be detached from its associated plane",
    "Curtain System could not reacquire Number faces out of Number.",
    "Can't find some new hosts for this Element.\nIt will lose references on Finish Paste unless repositioned or rehosted.",
    "An unbounded circle can only be used to construct a spiral shape.",
    "Cannot add element to Circuit. The Type for the available connector does not match the Type (Type Name) for the Circuit.",
    "Elements that cannot be grouped were removed from groups of type \"Type Name\".",
    "The dimension segment containing the override(s) shown below has been removed. The override text will no longer appear.Description",
    "Nothing will be divided.",
    "Linked Imported Files cannot be copied across projects.  All non-RVT linked files will be pasted as imports instead.",
    "Group members have been excluded from this group instance.",
    "Imported objects located a large distance from the model might not display properly.  The \"Center-to-Center\" option will be used.",
    "Start and end elevations are the same, nothing to Apply.",
    "Starting View ... will be deleted.  <Last Viewed> will be used when reopening the model.",
    "Coping applied, but no cut was made. Adjust Coping Distance or Offset parameters.",
    "Constraints between group members cannot be removed or excluded from the group.",
    "Name is empty and will be deleted.",
    "Space Type Bounding elements are highlighted.",
    "Type Name \"Type Name\" has been renamed to \"...\" to avoid conflicts with the existing Element.",
    "Deleting Grid Lines residing on faces that no longer are part of a Curtain System.",
    "Value out of range for Options enum",
    "Unable to trim slanted column end geometry to desired condition.",
    "Sizing failed.",
    "Dimension had to be unlocked and un-EQed in order to remove sketch over-constraining.",
    "Can't make Parts out of these Elements. Parts were deleted.",
    "Edits to these assemblies changed the naming category and name of these assemblies.",
    "Revit was not able to restore all of the requested group members.  The members may depend on elements that are still excluded.",
    "Some View Regions were consolidated. When the size of a View Break between View Regions becomes zero, the View Break is removed and the adjacent View Regions are joined.",
    "Fabrication Parts were not created because the selected System Type’s Fabrication Service is set to Undefined. Select the System, and click Edit Type in the Properties Palette to access the Fabrication Service setting.",
    "A sweep in a design option cannot be hosted by an element in the Main Model--if you continue it will not be added to the design option set.",
    "A corresponding Parametric cut for the Cope was created. The Cope will no longer modify the fabrication shape.",
    "Newly created link types and instances were placed in new workset Name.",
    "Cannot open file Text.",
    "Two points have to be selected before existing the edit mode",
    "Could not create integral wall sweep for wall instance. Description",
    "At least one of the overhangs in the minor direction is lower than radius of the wire in the major direction.",
    "There are grouped objects in the run. To repostion, ungroup them before using reposition.",
    "Changing this element's parameter has no effect on its current position or geometry. Check to see if the element is constrained either in the project view or in the element's sketch.",
    "An error occurred while trimming the vertical shadow of a room-bounding element Name of the bounding geometry for Room Name.",
    "Cannot assign or add element to Circuit. There is no assigned distribution system for element.",
    "Level \"Value\" of Classification Value is not an integer from 1 to 5.",
    "The selected fitting(s) cannot successfully change service or change size. You must disconnect the connections on the fitting(s) and try again.",
    "Curve elements forming a closed loop currently cannot be used as splitters and are ignored.",
    "The template applied to this panel schedule is set to display fewer slots than what is needed to display the maximum number of 1-pole breakers set on the equipment.",
    "No elements were added to the assembly. An assembly was not created.",
    "The phases of the two surfaces you are merging do not overlap. You can continue the operation, or cancel it and select a different pair of surfaces.",
    "The spacing in the major direction is lower than diameter of the wire in the minor direction.",
    "Type \"...\" has incorrect values for parameters. At least Bar Size 1 or Bar Size 2 should have another value than \"None\".",
    "A piece of boundary is too short to create stringer on it.",
    "Estimated Illumination failed. Light Loss factor not set for lighting fixture.",
    "Last copy of Group \"Name\" deleted. Group type removed from project.",
    "Can't convert Edges to Analytical Model curves.",
    "Light source can not be copied!",
    "The lap splice in the minor direction is greater than the half of the overall width.",
    "Curve elements forming a chain which is intersected by extensions of the chain ends cannot be used as splitters and are ignored.",
    "Can't finalize because dependent element failed to finalize.",
    "Estimated Illumination failed. Lumens not set for lighting fixture.",
    "Fail to generate automatic landing layout.",
    "The calculation was run with the Pressure Drop set to 0. Verify that the Loss Method on the connector is set correctly.  If you have an instance parameter defined for Pressure Drop, be sure that it is mapped to the corresponding parameter on the connector.",
    "Fabrication job contained invalid connections.",
    "Unable to load attached group Type Name of model group Type Name.",
    "Lining Thickness (Value) is too large for current Height (Value).",
    "Estimated Illumination failed. Coefficient of utilization not set for lighting fixture.",
    "The family Family Name was containing one or more invalid cuts, which have been removed (most likely it was cutting a curtain wall). Please examine the family and make changes as needed.",
    "A circle can't be converted to multiplanar shape.",
    "An attached group cannot be pasted into the selected view type and has been omitted from the elements being pasted.",
    "The fabrication part size is not within the correct size range for the service button condition.",
    "The minor loss calculation could not be performed.",
    "The Layout Pattern cannot accommodate the current data. Try decreasing the Number of Wires/Spacing.",
    "Elements do not intersect.",
    "Elements regenerated in pass 962260520",
    "One or more Profile Loops are invalid, probably because of self-intersection.",
    "Could not create Reveal. Description",
    "The element you are trying to connect to is assigned to a system that uses a different system type. You may want to edit the system type in order to merge the systems.",
    "Selection contains elements not allowed in an assembly. These elements will not be included in the assembly. Click Expand to view a list of these elements.",
    "Work Planes cannot be copied.",
    "Some elements already have parts. Parts will not be created from these elements.",
    "No merged part was created. Merge must include at least two adjacent parts made of the same material and the same creation and demolition phases.",
    "There exist geometry collision. These elements might not be copied.",
    "Duct Fitting/Accessory Pressure Drop Calculator Not Available: ...",
    "The cached version of this IFC file is already loaded into another document in this session, and can't be updated.  To update the IFC file, please close all other documents containing the link, and then update.",
    "The set of input elements was changed and the connection has been adjusted.",
    "Number Space Type created automatically.",
    "Curve elements forming a self-intersecting chain cannot be used as splitters and are ignored.",
    "The displayed Rebar Shape is created using a \"Rebar Bar for Preview\". This bar defines the bend radius displayed in the family. Using this preview bar the drawn shape cannot be completed.",
    "Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time.",
    "Portions of the topographic surface or points on the surface may not be visible in this view due to clipping by the view.",
    "Highlighted geometry no longer determines a plane",
    "The network needs an input element to perform the calculation.",
    "The model has no conditioned spaces.",
    "Multiple arcs are supported only if they are concentric and form a circle with an overlap.",
    "Review Number elements for correct position and shape",
    "Elements that were already in a Design Option were selected.  These will not be added to the Option Set.",
    "No keynote value is assigned to the keynoted element in the link \"Space Type\". Open the linked model to assign a keynote value to the element.",
    "Can't copy part of element",
    "Unable to maintain user changes to unpinned Chord. Restoring Truss-defined shape.",
    "Can’t auto-detect boundary.  The layers selected contain data that may make the Toposurface look incorrect.  For better results, try selecting only those layers that contain relevant 3D info.",
    "Edits caused the last instance of an assembly type to be deleted. The assembly type was removed from the Project Browser.",
    "A massing cannot be copied. Copy the elements within the massing instead.",
    "You have selected elements that are connected to other elements. These elements will also be added to the System.",
    "Found volumetric overlap between solids. They will be merged into one",
    "Can't place Balusters and/or Rails with desired offset",
    "Cannot process a surface-based splitter",
    "Custom connection does not include any sub-part and cannot be created.",
    "Unable to regenerate valid curve geometry.  It is likely that the driving points are coincident and the curve became zero length.  The line by points has been dissolved.",
    "Elements already monitored",
    "Dimension can't be driven by a formula parameter.",
    "Failed to merge overlapping solids",
    "Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed.",
    "The specified flow on this equipment is inconsistent with the other equipment in this branch. The branch flow is calculated based on the maximum specified value.",
    "Could not create Slab Edge. Description",
    "Defining face is not suitable for walls.",
    "In order to find a matching Name, the fitting \"Name\" has to be connected to a duct.",
    "Custom connection components have relationships that are not part of the connection.  Please include all related objects.",
    "Failed to create a Mass Floor.",
    "You have selected elements that are already part of other Circuits that have assigned Panels. The elements you selected can not be added to this Circuit.",
    "The element you are trying to connect to is assigned to a system that uses a different system classification. System calculations, such as flow analysis, cannot be performed between systems that have different system classifications.",
    "A point cannot coincide with end points of more than two curve elements. All curve elements adjacent to such a point are ignored.",
    "Cannot copy Render Appearance.",
    "A warning in family \"Name\" was dismissed. Please review warning information to determine if any changes are necessary",
    "Space Type is not in a properly enclosed region",
    "Cannot assign element to Circuit. The Type for the panel does not match the Type (Type Name) for the Circuit.",
    "A sub-Text Value specified as parent for its current ancestor Value",
    "Invalid family type \"Family Name\".",
    "The solution is failing to do the elements Phases are compatible.",
    "You have selected elements that are already part of other Systems that have assigned Equipment. The elements you selected can not be added to this System.",
    "Failed to split face by ground plane.",
    "In order to find a matching Name, the fitting \"Name\" has to be connected to a pipe.",
    "The network needs an output element to perform the calculation.",
    "No form elements selected to dissolve.",
    "Stair component(s) in the multistory stair are updated due to the level height changes.",
    "... cap was added.",
    "Parts created from linked originals were deleted when binding the link.",
    "Workset is editable, but you can't edit the element until \"Borrowers\" resaves the element to central and relinquishes it and you Reload Latest.",
    "Structural Element may not be supported -- verify support for Element.",
    "A generic error has occurred.",
    "The part specification is invalid.",
    "The type(s) of the selected element(s) are driven by family parameter(s). Changing the type directly will break the association.",
    "Cannot create specified fillet for rail join(s). Please try a different value.",
    "Element cannot be added to the Assembly. It will be added to the project.",
    "While making curved beam type \"Type Name\" Symbol elements were not created",
    "The division contains no dividing references.",
    "Revit was unable to identify any rooms. If you are sure that rooms have been created in the project, please check the Project Phase setting to verify that the Project Phase matches the phase in which rooms have been defined in your project.",
    "Room is not upper bounded by a roof, ceiling or floor element. This can result in incorrect adjacencies and voids in the analytical model. Please ensure that Upper Limit and Limit Offset for Room is set correctly.",
    "Elements can't be duplicated",
    "Can't move Load based on the Host Element."
  ]
}